/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[MeshComponent.h] 入力コンポーネントのベースコンポーネント
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：入力コンポーネントのコンポーネントのベースになるクラス定義
=============================================================================*/
#ifndef MESH_COMPONENT_H_
#define	MESH_COMPONENT_H_

/*--- インクルードファイル ---*/
#include "../RenderComponent.h"

/*--- 構造体定義 ---*/

/*--- クラスの前方宣言 ---*/


/*-------------------------------------
/* 入力コンポーネントのベースクラス
-------------------------------------*/
class MeshComponent : public RenderComponent
{
public:
	MeshComponent(class GameObject* owner, int updateOrder = 100);
	~MeshComponent(void);

	TypeID GetComponentType(void) const override { return TypeID::MeshComponent; }

private:
protected:
};


#endif //RENDER_COMPONENT_H_
/*=============================================================================
/*		End of File
=============================================================================*/