/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[ArmComponent.h] アームコンポーネントのベースコンポーネント
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：カメラアームなどのコンポーネントのベースになるクラス定義
=============================================================================*/
#ifndef ARM_COMPONENT_H_
#define	ARM_COMPONENT_H_

/*--- インクルードファイル ---*/
#include "../Component.h"

/*--- 構造体定義 ---*/

/*--- クラスの前方宣言 ---*/


/*-------------------------------------
/* アームコンポーネントのベースクラス
-------------------------------------*/
class ArmComponent : public Component
{
public:
	ArmComponent(class GameObject* owner, int updateOrder = 100);
	~ArmComponent(void);

	virtual TypeID GetComponentType() const override { return TypeID::ArmComponent; };

private:
protected:
};

#endif //ARM_COMPONENT_H_
/*=============================================================================
/*		End of File
=============================================================================*/