/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[Renderer.h] レンダラーモジュールヘッダ
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：レンダラーの出力処理部分をまとめたクラス
=============================================================================*/
#ifndef RENDERER_H_
#define	RENDERER_H_

/*--- インクルードファイル ---*/
#include "StdAfx.h"

/*--- 構造体定義 ---*/

/*--- クラスの前方宣言 ---*/


/*-------------------------------------
/*レンダラーの出力処理のまとめクラス
-------------------------------------*/
class Renderer
{
public:
	Renderer(class GameManager* gameManager);
	~Renderer();

	void Draw(void);

	void AddSprite(class SpriteComponent* spriteComponent);
	void RemoveSprite(class SpriteComponent* spriteComponent);


private:
	std::vector<class SpriteComponent*> sprites_;
};


#endif //RENDERER_H_
/*=============================================================================
/*		End of File
=============================================================================*/