/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[Renderer.cpp] レンダラーモジュール
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：レンダラーの出力処理部分をまとめたクラス
=============================================================================*/

/*--- インクルードファイル ---*/
#include "StdAfx.h"
#include "Renderer.h"
#include "GameObjects/Component/RenderComponent/SpriteComponent.h"

/*-----------------------------------------------------------------------------
/* コンストラクタ
-----------------------------------------------------------------------------*/
Renderer::Renderer(GameManager* gameManager)
{
	std::cout << "レンダラー生成\n";
}


/*-----------------------------------------------------------------------------
/* デストラクタ
-----------------------------------------------------------------------------*/
Renderer::~Renderer()
{
	std::cout << "レンダラー破棄\n";
}

/*-----------------------------------------------------------------------------
/* 描画処理
-----------------------------------------------------------------------------*/
void Renderer::Draw(void)
{
	std::cout << "\n";
	std::cout << "レンダラーの出力化処理の開始\n";

	for (auto sprite : sprites_)
	{
		sprite->Draw();
	}

	std::cout << "レンダラーの出力化処理の終了\n";
	std::cout << "\n";
}

/*-----------------------------------------------------------------------------
/* スプライトの追加処理
-----------------------------------------------------------------------------*/
void Renderer::AddSprite(SpriteComponent* spriteComponent)
{
	int myDrawOrder = spriteComponent->GetDrawOrder();
	auto iter = sprites_.begin();
	for (;
		iter != sprites_.end();
		++iter)
	{
		if (myDrawOrder < (*iter)->GetDrawOrder())
		{
			break;
		}
	}

	// Inserts element before position of iterator
	sprites_.insert(iter, spriteComponent);

}

/*-----------------------------------------------------------------------------
/* スプライトの削除処理
-----------------------------------------------------------------------------*/
void Renderer::RemoveSprite(SpriteComponent* spriteComponent)
{ 
	auto iter = std::find(sprites_.begin(), sprites_.end(), spriteComponent);
	sprites_.erase(iter);
}
/*=============================================================================
/*		End of File
=============================================================================*/