/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[Camera.h] カメラのゲームオブジェクト
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：カメラのゲームオブジェクトのクラス定義
=============================================================================*/
#ifndef CAMERA_H_
#define	CAMERA_H_

/*--- インクルードファイル ---*/
#include "../GameObject.h"

/*--- 構造体定義 ---*/

/*--- クラスの前方宣言 ---*/


/*-------------------------------------
/*　カメラのゲームオブジェクトクラス
-------------------------------------*/
class Camera : public GameObject
{
public:
	Camera(class GameManager* gameManager);
	~Camera(void);

	void UpdateGameObject(float deltaTime) override;

	virtual TypeID GetType(void) const { return TypeID::Camera; }


private:
	class CameraComponent* camera_component_;
};

#endif //CAMERA_H_
/*=============================================================================
/*		End of File
=============================================================================*/